---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheetType.IsValidMinorLapSplice(System.Double)
source: html/9ceacf3d-8ffc-6f9b-ae5e-364efdd2d864.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.IsValidMinorLapSplice Method

Identifies if the input value is valid to be applied as the minor lap splice
 value for this FabricSheetType.

## Syntax (C#)
```csharp
public bool IsValidMinorLapSplice(
	double minorLapSplice
)
```

## Parameters
- **minorLapSplice** (`System.Double`)